BellerageHackathon/src/Enums/СтатусыПроверкиОтвета/СтатусыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиОтвета</name>
  <enumValues>
    <name>НеПроверен</name>
  </enumValues>
  <enumValues>
    <name>Правильный</name>
  </enumValues>
  <enumValues>
    <name>Неправильный</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРучнойПроверки</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыПроверкиПопытки/СтатусыПроверкиПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиПопытки</name>
  <enumValues>
    <name>НеПроверена</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРучнойПроверки</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаВручную</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/РезультатыПрохождения/РезультатыПрохождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыПрохождения</name>
  <enumValues>
    <name>НеОпределен</name>
  </enumValues>
  <enumValues>
    <name>Пройден</name>
  </enumValues>
  <enumValues>
    <name>НеПройден</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/ТипыСообщенийОбмена/ТипыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийОбмена</name>
  <enumValues>
    <name>ПубликацияВерсииТеста</name>
  </enumValues>
  <enumValues>
    <name>АрхивацияТеста</name>
  </enumValues>
  <enumValues>
    <name>РезультатПопытки</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>РезультатРучнойПроверки</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СпособыПроверкиОтвета/СпособыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПроверкиОтвета</name>
  <enumValues>
    <name>ТочныйВариант</name>
  </enumValues>
  <enumValues>
    <name>ТочныйНабор</name>
  </enumValues>
  <enumValues>
    <name>ТекстПоЭталону</name>
  </enumValues>
  <enumValues>
    <name>РучнаяПроверка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Documents/РезультатПопытки/РезультатПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатПопытки</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПопытки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РевизияРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНазначения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.КандидатыВнешние</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКандидатаСнимок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшВерсииТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗавершения</name>
    <type>
      <types>EnumRef.СпособыЗавершенияПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>EnumRef.СтатусыПроверкиПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПрохождения</name>
    <type>
      <types>EnumRef.РезультатыПрохождения</types>
    </type>
  </attributes>
  <attributes>
    <name>НабраноБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПравильныхОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллСнимок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшИсходногоСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеСообщение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВопросВерсии</name>
      <type>
        <types>CatalogRef.ВопросыВерсийТестов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопросаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветаСнимок</name>
      <type>
        <types>EnumRef.ТипыОтветов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветДан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПроверки</name>
      <type>
        <types>EnumRef.СтатусыПроверкиОтвета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПравильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НабраноБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаВерсии</name>
      <type>
        <types>CatalogRef.ВариантыОтветовВерсий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторВерсииВарианта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВариантаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BellerageHackathon/src/CommonModules/РасчетРезультатовТестовСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция РассчитатьПроцент(НабранныеБаллы, МаксимальныеБаллы, Точность = 3) Экспорт

	ПроверитьПараметрыРасчета(НабранныеБаллы, МаксимальныеБаллы, Точность);
	Возврат Окр(НабранныеБаллы / МаксимальныеБаллы * 100, Точность);

КонецФункции

Функция РассчитатьИтог(НабранныеБаллы, МаксимальныеБаллы, ПроходнойБалл, Точность = 3) Экспорт

	Если ТипЗнч(ПроходнойБалл) <> Тип("Число")
		Или ПроходнойБалл < 0
		Или ПроходнойБалл > 100 Тогда
		ВызватьИсключение "Проходной балл должен быть числом от 0 до 100.";
	КонецЕсли;

	Процент = РассчитатьПроцент(НабранныеБаллы, МаксимальныеБаллы, Точность);

	Возврат Новый Структура(
		"НабранныеБаллы, МаксимальныеБаллы, Процент, ПроходнойБалл, Пройден",
		НабранныеБаллы,
		МаксимальныеБаллы,
		Процент,
		ПроходнойБалл,
		Процент >= ПроходнойБалл);

КонецФункции

Функция РассчитатьИтогПоОтветам(Ответы, ПроходнойБалл, Точность = 3) Экспорт

	Если Ответы = Неопределено Тогда
		ВызватьИсключение "Не передана коллекция ответов.";
	КонецЕсли;

	НабранныеБаллы = 0;
	МаксимальныеБаллы = 0;
	КоличествоОтветов = 0;
	КоличествоПравильных = 0;
	ЕстьОжидающиеПроверки = Ложь;

	Для Каждого Ответ Из Ответы Цикл
		КоличествоОтветов = КоличествоОтветов + 1;
		ПроверитьОтвет(Ответ);

		НабранныеБаллы = НабранныеБаллы + Ответ.НабраноБаллов;
		МаксимальныеБаллы = МаксимальныеБаллы + Ответ.МаксимальныйБалл;

		Если Ответ.ОтветПравильный Тогда
			КоличествоПравильных = КоличествоПравильных + 1;
		КонецЕсли;

		Если Ответ.СтатусПроверки
			= Перечисления.СтатусыПроверкиОтвета.ОжидаетРучнойПроверки
            Или Ответ.СтатусПроверки = Перечисления.СтатусыПроверкиОтвета.НеПроверен Тогда
			ЕстьОжидающиеПроверки = Истина;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоОтветов = 0 Тогда
		ВызватьИсключение "В результате попытки нет ответов.";
	КонецЕсли;

	Итог = РассчитатьИтог(
		НабранныеБаллы,
		МаксимальныеБаллы,
		ПроходнойБалл,
		Точность);

	ПроцентПравильныхОтветов = Окр(
		КоличествоПравильных / КоличествоОтветов * 100,
		Точность);

	Итог.Вставить("КоличествоОтветов", КоличествоОтветов);
	Итог.Вставить("КоличествоПравильныхОтветов", КоличествоПравильных);
	Итог.Вставить("ПроцентПравильныхОтветов", ПроцентПравильныхОтветов);
	Итог.Вставить("ЕстьОжидающиеПроверки", ЕстьОжидающиеПроверки);

	Возврат Итог;

КонецФункции

Процедура ЗаполнитьИтогиПопытки(ДокументРезультата, ПроверкаВручную = Ложь) Экспорт

	Итог = РассчитатьИтогПоОтветам(
		ДокументРезультата.Ответы,
		ДокументРезультата.ПроходнойБаллСнимок);

	ДокументРезультата.НабраноБаллов = Итог.НабранныеБаллы;
	ДокументРезультата.МаксимумБаллов = Итог.МаксимальныеБаллы;
	ДокументРезультата.ПроцентБаллов = Итог.Процент;
	ДокументРезультата.ПроцентПравильныхОтветов = Итог.ПроцентПравильныхОтветов;

	Если Итог.ЕстьОжидающиеПроверки Тогда
		ДокументРезультата.СтатусПроверки =
			Перечисления.СтатусыПроверкиПопытки.ОжидаетРучнойПроверки;
		ДокументРезультата.РезультатПрохождения =
			Перечисления.РезультатыПрохождения.НеОпределен;
	Иначе
		Если ПроверкаВручную Тогда
			ДокументРезультата.СтатусПроверки =
				Перечисления.СтатусыПроверкиПопытки.ПроверенаВручную;
		Иначе
			ДокументРезультата.СтатусПроверки =
				Перечисления.СтатусыПроверкиПопытки.ПроверенаАвтоматически;
		КонецЕсли;

		Если Итог.Пройден Тогда
			ДокументРезультата.РезультатПрохождения =
				Перечисления.РезультатыПрохождения.Пройден;
		Иначе
			ДокументРезультата.РезультатПрохождения =
				Перечисления.РезультатыПрохождения.НеПройден;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ЗавершитьРучнуюПроверку(РезультатПопытки) Экспорт

	Если Не ЗначениеЗаполнено(РезультатПопытки) Тогда
		ВызватьИсключение "Не указан результат попытки.";
	КонецЕсли;

	НачатьТранзакцию();
    Попытка
    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить("Документ.РезультатПопытки");
    Элемент.УстановитьЗначение("Ссылка", РезультатПопытки);
    Блокировка.Заблокировать();
    Документ = РезультатПопытки.ПолучитьОбъект();
    Если Документ.СтатусПроверки = Перечисления.СтатусыПроверкиПопытки.ПроверенаВручную Тогда
        ВызватьИсключение "Ручная проверка уже завершена.";
    КонецЕсли;
	Для Каждого Ответ Из Документ.Ответы Цикл
		Если Ответ.СтатусПроверки
			= Перечисления.СтатусыПроверкиОтвета.ОжидаетРучнойПроверки
			Или Ответ.СтатусПроверки
				= Перечисления.СтатусыПроверкиОтвета.НеПроверен Тогда
			ВызватьИсключение "Не все ответы прошли ручную проверку.";
		КонецЕсли;
	КонецЦикла;

	ЗаполнитьИтогиПопытки(Документ, Истина);
	Документ.Записать();

	ПолезнаяНагрузка = СформироватьJSONРучнойПроверки(Документ);
	Хэш = ИнтеграцияСЭлементомСервер.ВычислитьХэшПолезнойНагрузки(
		ПолезнаяНагрузка);

	Сообщение = ИнтеграцияСЭлементомСервер.СоздатьИсходящееСообщение(
		Перечисления.ТипыСообщенийОбмена.РезультатРучнойПроверки,
		Документ.ИдентификаторПопытки,
		ПолезнаяНагрузка,
		Хэш,
		Документ.ИдентификаторСообщения);

    ЗафиксироватьТранзакцию();
    Возврат Сообщение;
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецФункции

Функция СформироватьJSONРучнойПроверки(Документ)

	ОтветыJSON = Новый Массив;
	Для Каждого Ответ Из Документ.Ответы Цикл
		ОтветJSON = Новый Структура;
		ОтветJSON.Вставить("answerId", Строка(Ответ.ИдентификаторОтвета));
		ОтветJSON.Вставить("checkStatus", КодСтатусаПроверкиОтвета(Ответ.СтатусПроверки));
		ОтветJSON.Вставить("isCorrect", Ответ.ОтветПравильный);
		ОтветJSON.Вставить("awardedPoints", Ответ.НабраноБаллов);
		ОтветJSON.Вставить("reviewComment", Ответ.КомментарийПроверки);
		ОтветыJSON.Добавить(ОтветJSON);
	КонецЦикла;

	Данные = Новый Структура;
	Данные.Вставить("schemaVersion", "1.0");
	Данные.Вставить("eventType", "attempt.manualReviewCompleted");
	Данные.Вставить("attemptId", Строка(Документ.ИдентификаторПопытки));
	Данные.Вставить("checkedAt", XMLСтрока(ТекущаяДатаСеанса()));
	Данные.Вставить("result", КодРезультатаПрохождения(Документ.РезультатПрохождения));
	Данные.Вставить("score", Документ.НабраноБаллов);
	Данные.Вставить("maxScore", Документ.МаксимумБаллов);
	Данные.Вставить("scorePercent", Документ.ПроцентБаллов);
	Данные.Вставить("correctAnswersPercent", Документ.ПроцентПравильныхОтветов);
	Данные.Вставить("answers", ОтветыJSON);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	Возврат Запись.Закрыть();

КонецФункции

Функция КодСтатусаПроверкиОтвета(Статус)

	Если Статус = Перечисления.СтатусыПроверкиОтвета.Правильный Тогда
		Возврат "correct";
	ИначеЕсли Статус = Перечисления.СтатусыПроверкиОтвета.Неправильный Тогда
		Возврат "incorrect";
	КонецЕсли;

	ВызватьИсключение "Ответ не имеет окончательного статуса проверки.";

КонецФункции

Функция КодРезультатаПрохождения(Результат)

	Если Результат = Перечисления.РезультатыПрохождения.Пройден Тогда
		Возврат "passed";
	ИначеЕсли Результат = Перечисления.РезультатыПрохождения.НеПройден Тогда
		Возврат "failed";
	КонецЕсли;

	Возврат "pending";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьОтвет(Ответ)

	Если Ответ.МаксимальныйБалл <= 0 Тогда
		ВызватьИсключение "Максимальный балл ответа должен быть больше нуля.";
	КонецЕсли;

	Если Ответ.НабраноБаллов < 0
		Или Ответ.НабраноБаллов > Ответ.МаксимальныйБалл Тогда
		ВызватьИсключение "Набранный балл ответа должен быть от нуля до максимального.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПараметрыРасчета(НабранныеБаллы, МаксимальныеБаллы, Точность)

	Если ТипЗнч(НабранныеБаллы) <> Тип("Число")
		Или ТипЗнч(МаксимальныеБаллы) <> Тип("Число") Тогда
		ВызватьИсключение "Баллы должны иметь тип Число.";
	КонецЕсли;

	Если МаксимальныеБаллы <= 0 Тогда
		ВызватьИсключение "Максимальное количество баллов должно быть больше нуля.";
	КонецЕсли;

	Если НабранныеБаллы < 0
		Или НабранныеБаллы > МаксимальныеБаллы Тогда
		ВызватьИсключение "Набранные баллы должны быть от нуля до максимального значения.";
	КонецЕсли;

	Если ТипЗнч(Точность) <> Тип("Число")
		Или Точность <> Цел(Точность)
		Или Точность < 0
		Или Точность > 3 Тогда
		ВызватьИсключение "Точность должна быть целым числом от 0 до 3.";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Функция НормализоватьТекстОтвета(Текст, УчитыватьРегистр, ОбрезатьКрая, СхлопыватьПробелы) Экспорт
    Результат = Строка(Текст);
    Если СхлопыватьПробелы Тогда
        Результат = СтрЗаменить(Результат, Символы.Таб, " ");
        Результат = СтрЗаменить(Результат, Символы.ВК, " ");
        Результат = СтрЗаменить(Результат, Символы.ПС, " ");
        Пока СтрНайти(Результат, "  ") > 0 Цикл
            Результат = СтрЗаменить(Результат, "  ", " ");
        КонецЦикла;
    КонецЕсли;
    Если ОбрезатьКрая Тогда Результат = СокрЛП(Результат); КонецЕсли;
    Если Не УчитыватьРегистр Тогда Результат = НРег(Результат); КонецЕсли;
    Возврат Результат;
КонецФункции

Функция ТочныйНаборВариантов(Выбранные, Правильные) Экспорт
    Если Выбранные.Количество() <> Правильные.Количество() Или Правильные.Количество() = 0 Тогда Возврат Ложь; КонецЕсли;
    Уникальные = Новый Соответствие;
    Для Каждого Значение Из Выбранные Цикл
        Если Правильные.Найти(Значение) = Неопределено Или Уникальные.Получить(Значение) <> Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
        Уникальные.Вставить(Значение, Истина);
    КонецЦикла;
    Возврат Истина;
КонецФункции

Функция ОценитьОтвет(Правило, ТекстОтвета, Выбранные, Правильные) Экспорт
    Результат = Новый Структура("ОтветПравильный,НабраноБаллов,СтатусПроверки",
        Ложь, 0, Перечисления.СтатусыПроверкиОтвета.Неправильный);
    Если Правило.СпособПроверки = Перечисления.СпособыПроверкиОтвета.РучнаяПроверка Тогда
        Результат.СтатусПроверки = Перечисления.СтатусыПроверкиОтвета.ОжидаетРучнойПроверки;
        Возврат Результат;
    ИначеЕсли Правило.СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТочныйВариант Тогда
        Результат.ОтветПравильный = Выбранные.Количество() = 1 И ТочныйНаборВариантов(Выбранные, Правильные);
    ИначеЕсли Правило.СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТочныйНабор Тогда
        Результат.ОтветПравильный = ТочныйНаборВариантов(Выбранные, Правильные);
    ИначеЕсли Правило.СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТекстПоЭталону Тогда
        Текст = НормализоватьТекстОтвета(ТекстОтвета, Правило.УчитыватьРегистр, Правило.ОбрезатьПробелыПоКраям, Правило.СхлопыватьПовторныеПробелы);
        Эталон = НормализоватьТекстОтвета(Правило.ЭталонныйОтвет, Правило.УчитыватьРегистр, Правило.ОбрезатьПробелыПоКраям, Правило.СхлопыватьПовторныеПробелы);
        Результат.ОтветПравильный = Текст = Эталон;
    Иначе
        ВызватьИсключение "Неизвестное правило оценки.";
    КонецЕсли;
    Если Результат.ОтветПравильный Тогда
        Результат.НабраноБаллов = Правило.МаксимальныйБалл;
        Результат.СтатусПроверки = Перечисления.СтатусыПроверкиОтвета.Правильный;
    КонецЕсли;
    Возврат Результат;
КонецФункции
